results/raw/qwen3.8-27b-obliterated/gpu_1x_pro_6000_blackwell/vllm-c8.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7d9b95dd5580>, trust_remote_code=False, seed=0, num_prompts=40, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=128, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model='OBLITERATUS/Qwen3.8-27B-OBLITERATED', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/tmp', result_filename='vllm-c8.json', ignore_eos=False, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-d56cdfbb-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-31 15:13:00 [utils.py:90] Sampling input_len from [128, 128] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     40        
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  26.34     
Total input tokens:                      5120      
Total generated tokens:                  5120      
Request throughput (req/s):              1.52      
Output token throughput (tok/s):         194.42    
Peak output token throughput (tok/s):    208.00    
Peak concurrent requests:                16.00     
Total token throughput (tok/s):          388.83    
---------------Time to First Token----------------
Mean TTFT (ms):                          190.91    
Median TTFT (ms):                        195.66    
P99 TTFT (ms):                           212.21    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          39.95     
Median TPOT (ms):                        39.95     
P99 TPOT (ms):                           40.17     
---------------Inter-token Latency----------------
Mean ITL (ms):                           39.95     
Median ITL (ms):                         39.92     
P99 ITL (ms):                            40.71     
==================================================
VLLM_BENCH_DONE

+ MODEL=OBLITERATUS/Qwen3.8-27B-OBLITERATED
+ PORT=8000
+ OUT=/home/Ubuntu/mc-bench/vllm-c8.json
+ CONC=8
+ . /home/Ubuntu/mc-bench/venv/bin/activate
++ deactivate nondestructive
++ '[' -n '' ']'
++ '[' -n '' ']'
++ hash -r
++ '[' -n '' ']'
++ unset VIRTUAL_ENV
++ unset VIRTUAL_ENV_PROMPT
++ '[' '!' nondestructive = nondestructive ']'
++ '[' linux-gnu = cygwin ']'
++ '[' linux-gnu = msys ']'
++ export VIRTUAL_ENV=/home/Ubuntu/mc-bench/venv
++ VIRTUAL_ENV=/home/Ubuntu/mc-bench/venv
++ _OLD_VIRTUAL_PATH=/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/games:/usr/local/games:/snap/bin
++ PATH=/home/Ubuntu/mc-bench/venv/bin:/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/games:/usr/local/games:/snap/bin
++ export PATH
++ '[' -n '' ']'
++ '[' -z '' ']'
++ _OLD_VIRTUAL_PS1=
++ PS1='(venv) '
++ export PS1
++ VIRTUAL_ENV_PROMPT='(venv) '
++ export VIRTUAL_ENV_PROMPT
++ hash -r
+ sudo docker exec vllm-bench vllm bench serve --base-url http://127.0.0.1:8000 --backend openai --endpoint /v1/completions --model OBLITERATUS/Qwen3.8-27B-OBLITERATED --dataset-name random --random-input-len 128 --random-output-len 128 --num-prompts 40 --max-concurrency 8 --request-rate inf --save-result --result-dir /tmp --result-filename vllm-c8.json

  0%|          | 0/40 [00:00<?, ?it/s]
  2%|▎         | 1/40 [00:05<03:24,  5.25s/it]
 22%|██▎       | 9/40 [00:10<00:31,  1.03s/it]
 42%|████▎     | 17/40 [00:15<00:18,  1.22it/s]
 62%|██████▎   | 25/40 [00:21<00:11,  1.34it/s]
 82%|████████▎ | 33/40 [00:26<00:04,  1.41it/s]
100%|██████████| 40/40 [00:26<00:00,  1.52it/s]
+ sudo docker cp vllm-bench:/tmp/vllm-c8.json /home/Ubuntu/mc-bench/vllm-c8.json
+ echo VLLM_BENCH_DONE